Revit 2027 API
ParameterAccess Constructor
 Constructs a new ParameterAccess object bound to the given host document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ParameterAccess(
	Document doc
)
Public Sub New (
	doc As Document
)
public:
ParameterAccess(
	Document^ doc
)
new :
        doc : Document -> ParameterAccess
Parameters
doc Document
 The document that will be used to identify elements.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterAccess Class
Autodesk.Revit.DB Namespace